//Если ТипЗнч(Источник.Значение) = Тип("Булево") 
//	Или ТипЗнч(Источник.Значение) = Тип("Строка")
//	Или ТипЗнч(Источник.Значение) = Тип("Дата")
//	Или ТипЗнч(Источник.Значение) = Тип("Число")
//	Или ТипЗнч(Источник.Значение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
//	Или ТипЗнч(Источник.Значение) = Тип("СправочникСсылка.Контрагенты")
//	Или ТипЗнч(Источник.Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов")
//	Или ТипЗнч(Источник.Значение) = Тип("СправочникСсылка.Номенклатура")
//	Или ТипЗнч(Источник.Значение) = Тип("СправочникСсылка.Склады")
//	Или ТипЗнч(Источник.Значение) = Тип("СправочникСсылка.Пользователи")
//	Или ТипЗнч(Источник.Значение) = Тип("СправочникСсылка.Организации")
//	Или ТипЗнч(Источник.Значение) = Тип("СправочникСсылка.КлассификаторСтранМира")
//	Или ТипЗнч(Источник.Значение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
//	
//	//все правильно, переносим
//	
//Иначе
//	
//	Отказ = Истина;

//КонецЕсли;
