СтрНаименование = Источник.Наименование;

Разделители	=  " .,+,-,/,*,?,=,<,>,(,)%!@#$%&*""№:;{}[]?()\|/`~'^_";

Идентификатор = "";
БылСпецСимвол = Ложь;

Для НомСимвола = 1 По СтрДлина(СтрНаименование) Цикл
	
	Символ = Сред(СтрНаименование, НомСимвола, 1);
	
	Если Найти(Разделители, Символ) <> 0 Тогда
		БылСпецСимвол = Истина;
	ИначеЕсли БылСпецСимвол Тогда
		БылСпецСимвол = Ложь;
		Идентификатор = Идентификатор + ВРег(Символ);
	Иначе
		Идентификатор = Идентификатор + Символ;
	КонецЕсли;
	
КонецЦикла;

Значение = Идентификатор;
