ТипДокументаОснования = ТипЗнч(Объект.ДокументОснование); 
Если ТипДокументаОснования = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") 
 Или ТипДокументаОснования = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыКПоступлениюРеализацииОстатки.Номенклатура,
	|	ТоварыКПоступлениюРеализацииОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлениюРеализации.Остатки КАК ТоварыКПоступлениюРеализацииОстатки
	|ГДЕ
	|	ТоварыКПоступлениюРеализацииОстатки.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//документ нужно выгружать только тогда, когда уже готов полный ПО, т.е. РезультатЗапроса - пустой
	Если РезультатЗапроса.Пустой() Тогда
		
		Если ТипДокументаОснования = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
			ВыгрузитьПоПравилу(Объект.ДокументОснование, ,,,"ВозвратТоваровОтПокупателя");
		ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
			ВыгрузитьПоПравилу(Объект.ДокументОснование, ,,,"ПоступлениеТоваровУслуг");
		КонецЕсли;
		
	КонецЕсли;
		
	
КонецЕсли;
