
//нужные переменные
МетаданныеДокумента  = Объект.Метаданные();
ИскомоеПодразделение = Справочники.Подразделения.ПустаяСсылка();

/// ШАПКА 

//заполним склад отправителя
ИмяПараметра = "КодМагазинаОтправителя";
ИскомыйСклад = Справочники.Склады.ПустаяСсылка();
Выполнить(Алгоритмы.ОпределитьПараметрыМагазина);
Если Не ИскомыйСклад.Пустая() Тогда
	Объект.СкладОтправитель = ИскомыйСклад;
КонецЕсли;

//общие реквизиты шапки
Выполнить(Алгоритмы.ОбработкаШапки);

//заполним склад получателя
ИмяПараметра = "КодМагазинаПолучателя";
ИскомыйСклад = Справочники.Склады.ПустаяСсылка();
Выполнить(Алгоритмы.ОпределитьПараметрыМагазина);
Если Не ИскомыйСклад.Пустая() Тогда
	Объект.СкладПолучатель = ИскомыйСклад;
КонецЕсли;

Если ПараметрыОбъекта["ИспользованиеОрдернойСхемы"] Тогда
	Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукцияПоОрдерам;	
Иначе
	Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
КонецЕсли;

Если Не ЗначениеЗаполнено(Объект.НДСвСтоимостиТоваров) Тогда
	Объект.НДСвСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.НеИзменять;
КонецЕсли;

/// ТАБЛИЧНАЯ ЧАСТЬ

//работа с табличными частями
ИмяТабличнойЧасти = "Товары";
ДокументОбъект = Объект;
Выполнить(Алгоритмы.ОбработкаТабличнойЧасти);
