//признак проведения в управленческом учете
Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВУправленческомУчете", МетаданныеДокумента) Тогда
	Объект.ОтражатьВУправленческомУчете = Истина;
КонецЕсли;      


Если ОбщегоНазначения.ЕстьРеквизитДокумента("Подразделение", МетаданныеДокумента) 
	И Не ИскомоеПодразделение.Пустая() И Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
	Объект.Подразделение = ИскомоеПодразделение;
КонецЕсли;


Если ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) 
   И Не Объект.Организация.Пустая() И ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВБухгалтерскомУчете", МетаданныеДокумента) Тогда
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВНалоговомУчете", МетаданныеДокумента) Тогда		
		ОтражатьВНУ = "ОтражатьВНалоговомУчете";
	Иначе
		ОтражатьВНУ = "";
	КонецЕсли;
	
	ОбщегоНазначения.ОбработатьПризнакОтраженияВреглУчете(Объект, , ОтражатьВНУ, , Истина);
	
КонецЕсли;
