Если ПараметрыОбъекта <> Неопределено И НЕ ПустаяСтрока(ПараметрыОбъекта[ИмяПараметра]) Тогда 
	
	КодМагазина = ПараметрыОбъекта[ИмяПараметра];
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОбменУправлениеТорговлейРозничнаяТорговляСоответствияМагазиновИСкладов.СкладМагазина,
	|	ОбменУправлениеТорговлейРозничнаяТорговляСоответствияМагазиновИСкладов.КассаМагазина,
	|	ОбменУправлениеТорговлейРозничнаяТорговляСоответствияМагазиновИСкладов.КассаККММагазина,
	|	ОбменУправлениеТорговлейРозничнаяТорговляСоответствияМагазиновИСкладов.СкладМагазина.Подразделение КАК Подразделение,
	|	ОбменУправлениеТорговлейРозничнаяТорговляСоответствияМагазиновИСкладов.Организация
	|ИЗ
	|	ПланОбмена.ОбменУправлениеТорговлейРозничнаяТорговля.СоответствияМагазиновИСкладов КАК ОбменУправлениеТорговлейРозничнаяТорговляСоответствияМагазиновИСкладов
	|ГДЕ
	|	ОбменУправлениеТорговлейРозничнаяТорговляСоответствияМагазиновИСкладов.КодМагазина = &КодМагазина
	|	И ОбменУправлениеТорговлейРозничнаяТорговляСоответствияМагазиновИСкладов.Ссылка = &ЭтотУзел");
	
	Запрос.УстановитьПараметр("КодМагазина", КодМагазина);
	
	Запрос.УстановитьПараметр("ЭтотУзел", УзелОбменаЗагрузкаДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ИскомыйСклад         = Выборка.СкладМагазина;
		ИскомаяКасса         = Выборка.КассаМагазина;
		ИскомаяКассаККМ      = Выборка.КассаККММагазина;
		ИскомоеПодразделение = Выборка.Подразделение;
		ИскомаяОрганизация   = Выборка.Организация;
		
	Иначе
		
		#Если Клиент Тогда
			
		Сообщить("Не смог определить склад и кассы магазина " + КодМагазина + ". Проверьте табличную часть ""Соответствия магазинов и складов"" узла плана обмена ""Управление Торговлей Розничная Торговля""!");
		
		#КонецЕсли
		
	КонецЕсли;
	
КонецЕсли;
