Если СвойстваПоиска["ЭтоГруппа"] = Истина Тогда
	
	Если ЗначениеЗаполнено(НастройкаПоиска) Тогда
		
		Если НастройкаПоиска = "Ссылка" Тогда
			
			ПрекратитьПоиск = Истина;
			
		Иначе
			
			СтрокаИменСвойствПоиска = "Наименование, ЭтоГруппа";
			
		КонецЕсли;
		
	Иначе
		ПрекратитьПоиск = Истина;
	КонецЕсли;
	
Иначе
	
	Если НастройкаПоиска = "Артикул" Тогда
		
		СтрокаИменСвойствПоиска = "Артикул, ЭтоГруппа";
		
	ИначеЕсли НастройкаПоиска = "Наименование" Тогда
		
		СтрокаИменСвойствПоиска = "Наименование, ЭтоГруппа";
		
	ИначеЕсли НастройкаПоиска = "Ссылка" Тогда
		
		ПрекратитьПоиск = Истина;
		
	ИначеЕсли НастройкаПоиска = "НаименованиеАртикул" Тогда
		
		СтрокаИменСвойствПоиска = "Наименование, Артикул, ЭтоГруппа";
		
	ИначеЕсли НастройкаПоиска = "НаименованиеРодитель" Тогда
		
		СтрокаИменСвойствПоиска = "Наименование, Родитель, ЭтоГруппа";
		
	ИначеЕсли НастройкаПоиска = "НаименованиеРодительАртикул" Тогда
		
		СтрокаИменСвойствПоиска = "Наименование, Родитель, Артикул, ЭтоГруппа";
		
	Иначе // По ссылке
		
		ПрекратитьПоиск = Истина;
		
	КонецЕсли;
	
КонецЕсли;
