//
Значение = Новый Структура;
Значение.Вставить("Дата");
Значение.Вставить("СрокДействия");
Значение.Вставить("Номер");
Значение.Вставить("Организация");
Значение.Вставить("ПометкаУдаления", Ложь);
Значение.Вставить("Владелец");
Значение.Вставить("Комментарий", "УТ103 -> УТ11");
Значение.Вставить("Наименование", "Типовое соглашение с комиссионерами");
Значение.Вставить("Статус", "Действует");
Значение.Вставить("Типовое", Истина);
Значение.Вставить("ТипЦен");
Значение.Вставить("ПроцентКомиссионногоВознаграждения");
Значение.Вставить("СпособРасчетаКомиссионногоВознаграждения");
Значение.Вставить("НалогообложениеНДС", "ПродажаОблагаетсяНДС");
Значение.Вставить("ВалютаВзаиморасчетов", Источник.ВалютаВзаиморасчетов);

Если ТипЗнч(Источник) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
	Если ТипЗнч(Источник.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
		Значение.Вставить("ЦенаВключаетНДС", Источник.ТипЦен.ЦенаВключаетНДС);	
	Иначе
		Значение.Вставить("ЦенаВключаетНДС", Ложь);	
	КонецЕсли;
Иначе	
	Значение.Вставить("ЦенаВключаетНДС", Источник.ЦенаВключаетНДС);
КонецЕсли;
