ТипОбъекта = ТипЗнч(Объект.Объект);

Если ТипОбъекта <> Параметры.ТипСправочникСсылкаНоменклатура 
   И ТипОбъекта <> Параметры.ТипСправочникСсылкаКонтрагенты 
   И ТипОбъекта <> Параметры.ТипСправочникСсылкаОрганизации 
   И ТипОбъекта <> Параметры.ТипСправочникСсылкаСклады 
   И ТипОбъекта <> Параметры.ТипСправочникСсылкаФизическиеЛица Тогда

	Отказ = Истина;
	

ИначеЕсли ТипОбъекта = Параметры.ТипСправочникСсылкаКонтрагенты Тогда
	
	Если Параметры.УзелДляОбменаОбъект.мЕстьФильтрПоКонтрагентам И НЕ Параметры.УзелДляОбменаОбъект.ЭлементВходитВТаблицу(Объект.Объект, "Контрагенты", "Контрагент") Тогда
		
		Отказ = Истина;	

	КонецЕсли;	
	
ИначеЕсли ТипОбъекта = Параметры.ТипСправочникСсылкаСклады Тогда
	
	КодМагазинаИзАлгоритма = "";
	
	СкладДляЗапроса = Объект.Объект;
	Выполнить(Алгоритмы.ПолучитьКодМагазинаПоСкладу);
	
	Если Не ПустаяСтрока(КодМагазинаИзАлгоритма) Тогда //этот склад переходит не в склад, а в магазин
		
		Отказ = Истина;
		
	 ИначеЕсли Параметры.УзелДляОбменаОбъект.мЕстьФильтрПоСкладам И НЕ Параметры.УзелДляОбменаОбъект.ЭлементВходитВТаблицу(Объект.Объект, "Склады", "Склад") Тогда
		
		Отказ = Истина;			
		
	КонецЕсли;

КонецЕсли;
