ПровестиЗаписьНеЗаписанныхОбъектов();

Для Каждого Запись Из Объект Цикл
	
	// Получим наименование характеристики товара
	НаименованиеХарактеристикиНоменклатуры = ПараметрыОбъекта["НаименованиеХарактеристикиНоменклатуры"];
	
	// Производим поиск характеристики товара
	Если НРег(СокрЛП(НаименованиеХарактеристикиНоменклатуры)) <> "не назначена" Тогда
	
	Если НЕ(ЗначениеЗаполнено(Запись.ХарактеристикаНоменклатуры) ИЛИ ПустаяСтрока(НаименованиеХарактеристикиНоменклатуры)) И ТипЗнч(Запись.Владелец)=Тип("СправочникСсылка.Номенклатура") Тогда
		
		Запись.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(НаименованиеХарактеристикиНоменклатуры, Истина,, Запись.Владелец);
		
		// Если не удалось найти - создаем новый элемент
		Если НЕ ЗначениеЗаполнено(Запись.ХарактеристикаНоменклатуры) И ЗначениеЗаполнено(Запись.Владелец) Тогда
			
			ХарактеристикаНоменклатурыОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			ХарактеристикаНоменклатурыОбъект.Владелец     = Запись.Владелец;
			ХарактеристикаНоменклатурыОбъект.Наименование = НаименованиеХарактеристикиНоменклатуры;
			ХарактеристикаНоменклатурыОбъект.ОбменДанными.Загрузка = Истина;
			ХарактеристикаНоменклатурыОбъект.Записать();
			Запись.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатурыОбъект.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КонецЕсли;
	// Внесем изменения в параметры отбора
	Объект.Отбор.ХарактеристикаНоменклатуры.Установить(Запись.ХарактеристикаНоменклатуры, Истина);
	
	// Качество устанавливается в новый только владелец не ссылка на справочник "Информационные карты"
	Если ТипЗнч(Запись.Владелец) <> Тип("СправочникСсылка.ИнформационныеКарты") Тогда
		Если НЕ ЗначениеЗаполнено(Запись.Качество) Тогда
			Запись.Качество = Справочники.Качество.Новый;
		КонецЕсли;
	КонецЕсли;
	
КонецЦикла;
