ТаблицаОбъектовЗапрещенныхДляРедактирования = Новый ТаблицаЗначений;
ТаблицаОбъектовЗапрещенныхДляРедактирования.Колонки.Добавить("Ссылка");
Параметры.Вставить("ТаблицаОбъектовЗапрещенныхДляРедактирования", ТаблицаОбъектовЗапрещенныхДляРедактирования);

//создадим таблицу для объектов, которые хотим разрешить редактировать
ТаблицаОбъектовРазрешенныхДляРедактирования = Новый ТаблицаЗначений;
ТаблицаОбъектовРазрешенныхДляРедактирования.Колонки.Добавить("Ссылка");
Параметры.Вставить("ТаблицаОбъектовРазрешенныхДляРедактирования", ТаблицаОбъектовРазрешенныхДляРедактирования);
