
МетаданныеОбъекта = Объект.Метаданные();

Если Параметры.УзелДляОбменаОбъект.Метаданные().Реквизиты.Найти("ДатаСвертки") <> Неопределено
	И ЗначениеЗаполнено(Параметры.УзелДляОбменаОбъект.ДатаСвертки)
	И Метаданные.Документы.Содержит(МетаданныеОбъекта)
	И Объект.Дата < Параметры.УзелДляОбменаОбъект.ДатаСвертки Тогда
	
	Отказ = Истина;
	
КонецЕсли;

Если НЕ Отказ Тогда
	Если Метаданные.Документы.Содержит(МетаданныеОбъекта) ИЛИ Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		
		Отказ  = Истина;
		ТипОбъекта = ТипЗнч(Объект);
		Если Метаданные.Справочники.Содержит(МетаданныеОбъекта) 
			И НЕ Объект.Предопределенный Тогда
			
			Объект.ПометкаУдаления = Истина;
			ЗаписатьОбъектВИБ(Объект,ТипОбъекта);
			
		КонецЕсли;
		
		
		Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
			
			Если Объект.Проведен Тогда
				
				ОтменитьПроведениеОбъектаВИБ(Объект, ТипОбъекта);
				
			КонецЕсли;
			
			Если ТипОбъекта = Тип("ДокументОбъект.ОтчетОРозничныхПродажах") Тогда
				
				УИД = Объект.Ссылка.УникальныйИдентификатор();
				
				ОбъектПКО = Документы.ПриходныйКассовыйОрдер.ПолучитьСсылку(УИД).ПолучитьОбъект();
				Если ОбъектПКО <> Неопределено Тогда
					ТипОбъектаПКО = ТипЗнч(ОбъектПКО);
					
					Если ОбъектПКО.Проведен Тогда
						
						ОтменитьПроведениеОбъектаВИБ(ОбъектПКО, ТипОбъектаПКО);
						
					КонецЕсли;
					
					ОбъектПКО.ПометкаУдаления = Истина;
					ЗаписатьОбъектВИБ(ОбъектПКО,ТипОбъектаПКО);
					
				КонецЕсли;
				
			КонецЕсли;	
			
			Объект.ПометкаУдаления = Истина;
			ЗаписатьОбъектВИБ(Объект,ТипОбъекта);
			
			
		КонецЕсли;
		
	КонецЕсли;	
КонецЕсли;
