	
	ЗапросЗаказа = Новый Запрос;
	ЗапросЗаказа.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПокупателейОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОстаткиИОбороты.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ЗаказыПокупателейОстаткиИОбороты.ЕдиницаИзмерения КАК Упаковка,
	|	ЗаказыПокупателейОстаткиИОбороты.Цена КАК Цена,
	|	ЗаказыПокупателейОстаткиИОбороты.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ЗаказыПокупателейОстаткиИОбороты.КоличествоОстаток) КАК КоличествоУпаковок,
	|	СУММА(ЗаказыПокупателейОстаткиИОбороты.ПроцентАвтоматическихСкидок + ЗаказыПокупателейОстаткиИОбороты.ПроцентСкидкиНаценки) КАК ПроцентРучнойСкидки
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(&ДатаОстатков, ЗаказПокупателя = &Заказ) КАК ЗаказыПокупателейОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПокупателейОстаткиИОбороты.Номенклатура,
	|	ЗаказыПокупателейОстаткиИОбороты.ХарактеристикаНоменклатуры,
	|	ЗаказыПокупателейОстаткиИОбороты.ЕдиницаИзмерения,
	|	ЗаказыПокупателейОстаткиИОбороты.Цена,
	|	ЗаказыПокупателейОстаткиИОбороты.СтавкаНДС
	|
	|ИМЕЮЩИЕ СУММА(ЗаказыПокупателейОстаткиИОбороты.КоличествоОстаток) > 0
	|";

	
	ЗапросЗаказа.УстановитьПараметр("Заказ",       ПараметрЗаказ);
	ЗапросЗаказа.УстановитьПараметр("ДатаОстатков", КонецДня(Параметры.ДатаОстатков));
	
	КоллекцияОбъектов  = ЗапросЗаказа.Выполнить().Выгрузить();
