//проверим возможность редактирования в базе приемнике
Если Объект.ЭтоНовый() Тогда
	
	СсылкаНаОбъект = Объект.ПолучитьСсылкуНового();
	
Иначе
	
	СсылкаНаОбъект = Объект.Ссылка;
	
КонецЕсли;

Если Булево(ПараметрыОбъекта["ВозможностьРедактированияВПриемнике"]) Тогда
	
	НоваяСтрока        = Параметры.ТаблицаОбъектовРазрешенныхДляРедактирования.Добавить();
	НоваяСтрока.Ссылка = СсылкаНаОбъект;
	
Иначе
	
	НоваяСтрока        = Параметры.ТаблицаОбъектовЗапрещенныхДляРедактирования.Добавить();
	НоваяСтрока.Ссылка = СсылкаНаОбъект;
	
КонецЕсли;
