КодМагазинаИзАлгоритма = "";

Запрос = Новый Запрос(
"ВЫБРАТЬ ПЕРВЫЕ 1
|	ЧистыйСофтПоПравиламКонвертацииСоответствияМагазиновИСкладов.КодМагазина
|ИЗ
|	ПланОбмена.ОбменУправлениеТорговлейРозничнаяТорговля.СоответствияМагазиновИСкладов КАК ЧистыйСофтПоПравиламКонвертацииСоответствияМагазиновИСкладов
|ГДЕ
|	ЧистыйСофтПоПравиламКонвертацииСоответствияМагазиновИСкладов.СкладМагазина = &Склад
|	И ЧистыйСофтПоПравиламКонвертацииСоответствияМагазиновИСкладов.Ссылка = &УзелДляОбмена");

Запрос.УстановитьПараметр("Склад", СкладДляЗапроса);
Запрос.УстановитьПараметр("УзелДляОбмена", УзелОбменаЗагрузкаДанных);

РезультатЗапроса = Запрос.Выполнить();
Если Не РезультатЗапроса.Пустой() Тогда
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	КодМагазинаИзАлгоритма = Выборка.КодМагазина;
	
КонецЕсли;
