
//нужные переменные
МетаданныеДокумента  = Объект.Метаданные();
ИскомоеПодразделение = Справочники.Подразделения.ПустаяСсылка();

/// ШАПКА 

//общие реквизиты шапки
Выполнить(Алгоритмы.ОбработкаШапки);

//проверим, что контрагент - покупатель
Если Не Объект.Контрагент.Покупатель Тогда
	Контрагент = Объект.Контрагент.ПолучитьОбъект();
	Если Контрагент <> Неопределено Тогда
		Контрагент.Покупатель = Истина;
		Контрагент.Записать();
	КонецЕсли;
КонецЕсли;

//заполним поле договор
ВалютаРегламентированногоУчета  = Константы.ВалютаРегламентированногоУчета.Получить();
Объект.ВалютаДокумента          = ВалютаРегламентированногоУчета;


//определим вид договора в табличной части и заодно статью движения денежных средств
ВидДоговора = Неопределено;
СтатьяДвиженияДенежныхСредств = Неопределено;
	
ВидДоговора                   = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;	

КонтрагентПараметр     = Объект.Контрагент;
ОрганизацияПараметр    = Объект.Организация;
ДатаПараметр           = Объект.Дата;
ДоговорВТабличнойЧасти = Истина;
ИмяТабличнойЧасти      = "РасшифровкаПлатежа";

Для Каждого СтрокаРасшифровкиПлатежа Из Объект.РасшифровкаПлатежа Цикл
	
	ДокументОбъект = СтрокаРасшифровкиПлатежа;
	Выполнить(Алгоритмы.УстановитьДоговорПоКонтрагенту);
	
	//расчитаем сумму взаиморасчетов
	Если ЗначениеЗаполнено(СтрокаРасшифровкиПлатежа.ДоговорКонтрагента) Тогда
		
		Если НЕ СтрокаРасшифровкиПлатежа.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
			И СтрокаРасшифровкиПлатежа.ДоговорКонтрагента.ВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
			
			СтрокаРасшифровкиПлатежа.СуммаВзаиморасчетов = СтрокаРасшифровкиПлатежа.СуммаПлатежа;
			
		Иначе
		
			СтрокаРасшифровкиПлатежа.СуммаВзаиморасчетов = СтрокаРасшифровкиПлатежа.СуммаПлатежа *  СтрокаРасшифровкиПлатежа.КратностьВзаиморасчетов
						/ СтрокаРасшифровкиПлатежа.КурсВзаиморасчетов;
						
		КонецЕсли;
		
	КонецЕсли;			
	
	//установим статью движения денежных средств
	СтрокаРасшифровкиПлатежа.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;	
КонецЦикла;


Объект.ДоговорВзаиморасчетовЭквайрера = Объект.ДоговорЭквайринга.ДоговорВзаиморасчетов;
