Запрос = Новый Запрос("
|ВЫБРАТЬ
|	БанковскиеСчета.Ссылка,
|	БанковскиеСчета.ПометкаУдаления,
|	БанковскиеСчета.Владелец,
|	БанковскиеСчета.Код,
|	БанковскиеСчета.Наименование,
|	БанковскиеСчета.НомерСчета,
|	БанковскиеСчета.Банк,
|	БанковскиеСчета.БанкДляРасчетов,
|	БанковскиеСчета.ТекстКорреспондента,
|	БанковскиеСчета.ТекстНазначения,
|	БанковскиеСчета.ВалютаДенежныхСредств
|ИЗ
|	Справочник.БанковскиеСчета КАК БанковскиеСчета
|ГДЕ
|	БанковскиеСчета.Владелец ССЫЛКА Справочник.Контрагенты
|");

ВыборкаДанных = Запрос;
