Запрос = Новый Запрос(
"ВЫБРАТЬ
|	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
|	ОтветственныеЛицаОрганизацииСрезПоследних.Должность КАК Должность
|ИЗ
|	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(
|			,
|			СтруктурнаяЕдиница = &Организация
|				И ОтветственноеЛицо = &ОтветственноеЛицо) КАК ОтветственныеЛицаОрганизацииСрезПоследних");
Запрос.УстановитьПараметр("Организация", Источник.Ссылка);
Запрос.УстановитьПараметр("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизации.Руководитель);

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	Значение = Выборка.ФизическоеЛицо;
КонецЕсли;
