	
	ЗапросЗаказа = Новый Запрос;
	ЗапросЗаказа.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстаткиИОбороты.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ЗаказыПоставщикамОстаткиИОбороты.ЕдиницаИзмерения КАК Упаковка,
	|	ЗаказыПоставщикамОстаткиИОбороты.Цена КАК Цена,
	|	ЗаказыПоставщикамОстаткиИОбороты.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ЗаказыПоставщикамОстаткиИОбороты.КоличествоОстаток) КАК КоличествоУпаковок
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&ДатаОстатков, ЗаказПоставщику = &Заказ) КАК ЗаказыПоставщикамОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстаткиИОбороты.Номенклатура,
	|	ЗаказыПоставщикамОстаткиИОбороты.ХарактеристикаНоменклатуры,
	|	ЗаказыПоставщикамОстаткиИОбороты.ЕдиницаИзмерения,
	|	ЗаказыПоставщикамОстаткиИОбороты.Цена,
	|	ЗаказыПоставщикамОстаткиИОбороты.СтавкаНДС
	|
	|ИМЕЮЩИЕ СУММА(ЗаказыПоставщикамОстаткиИОбороты.КоличествоОстаток) > 0
	|";

	
	ЗапросЗаказа.УстановитьПараметр("Заказ",        ПараметрЗаказ);
	ЗапросЗаказа.УстановитьПараметр("ДатаОстатков", КонецДня(Параметры.ДатаОстатков));
	
	КоллекцияОбъектов  = ЗапросЗаказа.Выполнить().Выгрузить();
