Если ПараметрыОбъекта <> Неопределено Тогда
	
	МассивНаименованийТиповВСтрокеВнутр = ПараметрыОбъекта.Получить("Тип");
	Если МассивНаименованийТиповВСтрокеВнутр <> Неопределено Тогда
		
		МассивНаименованийТипов = ЗначениеИзСтрокиВнутр(МассивНаименованийТиповВСтрокеВнутр);
		
		МассивТипов = Новый Массив;
		Для Каждого НаименованиеТипа Из МассивНаименованийТипов Цикл
			МассивТипов.Добавить(Тип(НаименованиеТипа));	
		КонецЦикла;
			
		Объект.ТипЗначения = Новый ОписаниеТипов(МассивТипов); 	
		
	КонецЕсли;
	
КонецЕсли;
