Запрос = Новый Запрос("
|ВЫБРАТЬ
|	Контрагенты.Ссылка КАК Ссылка,
|	Контрагенты.Наименование КАК Наименование,
|	Контрагенты.Код КАК Код,
|	Контрагенты.ОсновнойМенеджерПокупателя КАК ОсновнойМенеджер,
|	Контрагенты.Покупатель КАК Клиент,
|	Контрагенты.Поставщик КАК Поставщик,
|	ВЫБОР КОГДА Контрагенты.ГоловнойКонтрагент = Контрагенты.Ссылка ТОГДА
|		NULL
|	ИНАЧЕ
|		Контрагенты.ГоловнойКонтрагент
|	КОНЕЦ КАК Родитель,
|	ЛОЖЬ ЭтоГруппа,
|	Контрагенты.ГруппаДоступаККонтрагенту КАК ГруппаДоступа
|ИЗ
|	Справочник.Контрагенты КАК Контрагенты
|ГДЕ
|	НЕ Контрагенты.ЭтоГруппа
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	Контрагенты.ГоловнойКонтрагент КАК Ссылка,
|	Контрагенты.ГоловнойКонтрагент.Наименование КАК Наименование,
|	Контрагенты.ГоловнойКонтрагент.Код КАК Код,
|	NULL КАК ОсновнойМенеджер,
|	NULL КАК Клиент,
|	NULL КАК Поставщик,
|	NULL КАК Родитель,
|	ИСТИНА КАК ЭтоГруппа,
|	NULL КАК ГруппаДоступа
|ИЗ
|	Справочник.Контрагенты КАК Контрагенты
|ГДЕ
|	НЕ Контрагенты.ЭтоГруппа
|	И Контрагенты.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
|	И Контрагенты.ГоловнойКонтрагент <> Контрагенты.Ссылка
|");

ВыборкаДанных = Запрос;
