

МетаданныеДокумента  = Объект.Метаданные();
ИскомоеПодразделение = Справочники.Подразделения.ПустаяСсылка();
ИскомыйСклад         = Справочники.Склады.ПустаяСсылка();


/// ШАПКА 

//получим нужные поля по коду магазина
ИмяПараметра = "КодМагазина";
Выполнить(Алгоритмы.ОпределитьПараметрыМагазина);

//общие реквизиты шапки
Выполнить(Алгоритмы.ОбработкаШапки);


//заполним вид поступления и склад
Если Не ИскомыйСклад.Пустая() Тогда
	Объект.Склад = ИскомыйСклад;
КонецЕсли;

Если Не ЗначениеЗаполнено(Объект.НДСвСтоимостиТоваров) Тогда
	Объект.НДСвСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.НеИзменять;
КонецЕсли;

// Получим наименование характеристики товара
НаименованиеХарактеристикиНоменклатуры = ПараметрыОбъекта["НаименованиеХарактеристикиНоменклатуры"];

// Производим поиск характеристики товара
Если НРег(СокрЛП(НаименованиеХарактеристикиНоменклатуры)) <> "не назначена" Тогда
	
	Если НЕ (ЗначениеЗаполнено(Объект.ХарактеристикаНоменклатуры) ИЛИ ПустаяСтрока(НаименованиеХарактеристикиНоменклатуры)) Тогда
		
		Объект.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(ПараметрыОбъекта["НаименованиеХарактеристикиНоменклатуры"], Истина,, Объект.Номенклатура);
		
		// Если не удалось найти - создаем новый элемент
		Если НЕ ЗначениеЗаполнено(Объект.ХарактеристикаНоменклатуры) И ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			
			ХарактеристикаНоменклатурыОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			ХарактеристикаНоменклатурыОбъект.Владелец     = Объект.Номенклатура;
			ХарактеристикаНоменклатурыОбъект.Наименование = НаименованиеХарактеристикиНоменклатуры;
			ХарактеристикаНоменклатурыОбъект.ОбменДанными.Загрузка = Истина;
			ХарактеристикаНоменклатурыОбъект.Записать();
			Объект.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатурыОбъект.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецЕсли;

/// ТАБЛИЧНАЯ ЧАСТЬ

//работа с табличными частями
ИмяТабличнойЧасти = "Комплектующие";
ДокументОбъект = Объект;
Выполнить(Алгоритмы.ОбработкаТабличнойЧасти);
