Если (НЕ Объект.ЭтоГруппа) И Объект.ВидНоменклатуры.ИспользованиеХарактеристик=Перечисления.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ИспользоватьОбщиеДляВидаНоменклатуры Тогда
	
	Выборка = Справочники.ХарактеристикиНоменклатуры.Выбрать(, Объект.ВидНоменклатуры);
	
	Пока Выборка.Следующий() Цикл
		
		// Создадим новый объект элемента характеристики
		ХарактеристикаНоменклатурыОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		ХарактеристикаНоменклатурыОбъект.Владелец        = Объект.Ссылка;
		ХарактеристикаНоменклатурыОбъект.Наименование    = Выборка.Наименование;
		ХарактеристикаНоменклатурыОбъект.ПометкаУдаления = Выборка.ПометкаУдаления;
		
		// Выгружаем новый объект элемента характеристики
		ВыгрузитьПоПравилу(ХарактеристикаНоменклатурыОбъект,,,, "ХарактеристикиНоменклатуры");
		
	КонецЦикла;
	
КонецЕсли;
