

//нужные переменные
МетаданныеДокумента  = Объект.Метаданные();
ИскомоеПодразделение = Справочники.Подразделения.ПустаяСсылка();


/// ШАПКА 

//получим нужные поля по коду магазина
ИмяПараметра = "КодМагазина";
ИскомыйСклад = Справочники.Склады.ПустаяСсылка();

//общие реквизиты шапки
Выполнить(Алгоритмы.ОбработкаШапки);

//заполним склад
Выполнить(Алгоритмы.ОпределитьПараметрыМагазина);
Если Не ИскомыйСклад.Пустая() Тогда
	Объект.Склад = ИскомыйСклад;
КонецЕсли;


/// ТАБЛИЧНАЯ ЧАСТЬ

//работа с табличными частями
ИмяТабличнойЧасти = "Товары";
ДокументОбъект = Объект;
Выполнить(Алгоритмы.ОбработкаТабличнойЧасти);
