Запрос = Новый Запрос("
|ВЫБРАТЬ
|	ЕдиницыИзмерения.Ссылка КАК Ссылка,
|	ЕдиницыИзмерения.Вес КАК Вес,
|	ЕдиницыИзмерения.Объем КАК Объем,
|	ЕдиницыИзмерения.Владелец КАК Владелец,
|	ЕдиницыИзмерения.Коэффициент КАК Коэффициент,
|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаПоКлассификатору,
|	ЕдиницыИзмерения.ПометкаУдаления КАК ПометкаУдаления,
|	ЕдиницыИзмерения.Наименование КАК Наименование
|ИЗ
|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
|ГДЕ
|	ВЫРАЗИТЬ(ЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура).ЕдиницаХраненияОстатков <> ЕдиницыИзмерения.Ссылка
|");

ВыборкаДанных = Запрос;
