Если НРег(СокрЛП(Источник.Наименование)) = "не назначена" Тогда
	
	Отказ = Истина;
	
Иначе
	
Если НЕ Источник.Владелец=Неопределено Тогда
					
	// Характеристики, подчиненные виду номенклатуры выгружать не будем
	Если Источник.Владелец.ЭтоГруппа ИЛИ (НЕ ТипЗнч(Источник.Владелец)=Тип("СправочникСсылка.Номенклатура")) Тогда
		
		Отказ = Истина;
		
	КонецЕсли;
	
	// Если передали не записанный объект, то не следует его запоминать
	Если НЕ(Отказ И ЗначениеЗаполнено(Источник.Ссылка)) Тогда
		
		КлючВыгружаемыхДанных = "ХарактеристикаНоменклатуры."+Источник.Владелец.УникальныйИдентификатор()+"."+Источник.Наименование;
		СинхронизироватьПоИдентификатору = Ложь;
		
	КонецЕсли;
	
КонецЕсли;

КонецЕсли;
