//если документ оформлен по ордерной схеме и еще нет ПО по этому документу - документ вообще не отправляем
Если Источник.ПоступлениеПоОрдернойСхеме Тогда
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ПриходныйОрдерНаТовары.Ссылка
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	|ГДЕ
	|	ПриходныйОрдерНаТовары.ДокументОснование = &ДокументОснование
	|	И ПриходныйОрдерНаТовары.Проведен");
	
	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Значение = Строка(Выборка.Ссылка.УникальныйИдентификатор());
	КонецЕсли;
	
Иначе
	
	Отказ = Истина;
	
КонецЕсли;
