Если ВозможностьРедактированияВПриемнике Тогда

	Для Каждого ТабличнаяЧасть Из ТаблицаДляПроверкиТабличныхЧастей Цикл
	
		Для Каждого СтрокаТЧ Из Источник[ТабличнаяЧасть.ИмяТабличнойЧасти] Цикл
			
			Для Каждого ИмяРеквизита Из ТабличнаяЧасть.МассивРеквизитов Цикл
				
				Если ИмяРеквизита = "Качество" Тогда
					
					Если СтрокаТЧ.Качество <> Справочники.Качество.Новый Тогда
						ВозможностьРедактированияВПриемнике = Ложь;
						Прервать;
					КонецЕсли;
					
				Иначе
					
					Если ЗначениеЗаполнено(СтрокаТЧ[ИмяРеквизита]) Тогда
						ВозможностьРедактированияВПриемнике = Ложь;
						Прервать;
					КонецЕсли;

				КонецЕсли;
				
			КонецЦикла;
			
			//если уже определили, что нельзя редактировать - дальше можно не смотреть
			Если Не ВозможностьРедактированияВПриемнике Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		//если уже определили, что нельзя редактировать - дальше можно не смотреть
		Если Не ВозможностьРедактированияВПриемнике Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецЕсли;
