ВозможностьРедактированияВПриемнике = Истина;

ТаблицаДляПроверкиТабличныхЧастей = Новый ТаблицаЗначений;
ТаблицаДляПроверкиТабличныхЧастей.Колонки.Добавить("ИмяТабличнойЧасти");
ТаблицаДляПроверкиТабличныхЧастей.Колонки.Добавить("МассивРеквизитов");

ТабЧастьТовары = ТаблицаДляПроверкиТабличныхЧастей.Добавить();
ТабЧастьТовары.ИмяТабличнойЧасти = "Товары";
ТабЧастьТовары.МассивРеквизитов  = Новый Массив();
ТабЧастьТовары.МассивРеквизитов.Добавить("Дата");
ТабЧастьТовары.МассивРеквизитов.Добавить("ДокументУстановкиЦен");


Выполнить(Алгоритмы.ОпределитьВозможностьРедактированияВПриемникеПоТЧ);


Значение = Строка(ВозможностьРедактированияВПриемнике);
