
МассивНаименованийТипов = Новый Массив;

// То что закомментировано - не имеет соответствия.

СоответствиеТипов = Новый Соответствие;
СоответствиеТипов.Вставить(Тип("Число"),  "Число");
СоответствиеТипов.Вставить(Тип("Строка"), "Строка");
СоответствиеТипов.Вставить(Тип("Булево"), "Булево");
СоответствиеТипов.Вставить(Тип("Дата"),   "Дата");
СоответствиеТипов.Вставить(Тип("СправочникСсылка.ЗначенияСвойствОбъектов"),      "СправочникСсылка.ЗначенияСвойствОбъектов");
СоответствиеТипов.Вставить(Тип("СправочникСсылка.ФизическиеЛица"),               "СправочникСсылка.ФизическиеЛица");
СоответствиеТипов.Вставить(Тип("СправочникСсылка.Склады"),                       "СправочникСсылка.Склады");
СоответствиеТипов.Вставить(Тип("СправочникСсылка.Пользователи"),                 "СправочникСсылка.Пользователи");
СоответствиеТипов.Вставить(Тип("СправочникСсылка.Подразделения"),                "СправочникСсылка.СтруктураПредприятия");
СоответствиеТипов.Вставить(Тип("СправочникСсылка.Организации"),                  "СправочникСсылка.Организации");
//СоответствиеТипов.Вставить(Тип("СправочникСсылка.НоменклатурныеГруппы"),       "СправочникСсылка.ЗначенияСвойствОбъектов");
СоответствиеТипов.Вставить(Тип("СправочникСсылка.Номенклатура"),                 "СправочникСсылка.Номенклатура");
СоответствиеТипов.Вставить(Тип("СправочникСсылка.Контрагенты"),                  "СправочникСсылка.Партнеры");
//СоответствиеТипов.Вставить(Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов"),   "СправочникСсылка.КонтактныеЛицаПартнеров");
//СоответствиеТипов.Вставить(Тип("СправочникСсылка.КонтактныеЛица"),               "СправочникСсылка.ЗначенияСвойствОбъектов");
СоответствиеТипов.Вставить(Тип("СправочникСсылка.КлассификаторСтранМира"),         "СправочникСсылка.СтраныМира");
//СоответствиеТипов.Вставить(Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"), "СправочникСсылка.ЕдиницыИзмерения");
СоответствиеТипов.Вставить(Тип("СправочникСсылка.Валюты"),                         "СправочникСсылка.Валюты");

Для Каждого КлючИЗначение ИЗ СоответствиеТипов Цикл
	Если Источник.ТипЗначения.СодержитТип(КлючИЗначение.Ключ) Тогда
		МассивНаименованийТипов.Добавить(КлючИЗначение.Значение);	
	КонецЕсли;
КонецЦикла;

Значение = ЗначениеВСтрокуВнутр(МассивНаименованийТипов);
