Запрос = Новый Запрос("
|ВЫБРАТЬ
|	ДоговорыКонтрагентов.Ссылка                                   КАК Ссылка,
|	Ложь                                                          КАК Типовое,
|	ДоговорыКонтрагентов.ТипЦен.ЦенаВключаетНДС                   КАК ЦенаВключаетНДС,
|	ДоговорыКонтрагентов.ТипЦен                                   КАК ТипЦен,
|	ДоговорыКонтрагентов.Владелец                                 КАК Владелец,
|	ДоговорыКонтрагентов.Наименование                             КАК Наименование,
|	ДоговорыКонтрагентов.ПометкаУдаления                          КАК ПометкаУдаления,
|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов                     КАК ВалютаВзаиморасчетов,
|	ДоговорыКонтрагентов.Комментарий                              КАК Комментарий,
|	ДоговорыКонтрагентов.Организация                              КАК Организация,
|	ДоговорыКонтрагентов.ПроцентКомиссионногоВознаграждения       КАК ПроцентКомиссионногоВознаграждения,
|	ДоговорыКонтрагентов.СпособРасчетаКомиссионногоВознаграждения КАК СпособРасчетаКомиссионногоВознаграждения,
|	ДоговорыКонтрагентов.СрокДействия                             КАК СрокДействия,
|	ДоговорыКонтрагентов.Дата                                     КАК Дата,
|	ДоговорыКонтрагентов.Номер                                    КАК Номер
|ИЗ
|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
|ГДЕ
|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)
|	И (НЕ ДоговорыКонтрагентов.ЭтоГруппа)
|");

ВыборкаДанных = Запрос;
