ВладельцыХарактеристики = Новый Массив;

Если ТипЗнч(Источник.Объект)=Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
	
	Если ТипЗнч(Источник.Объект.Владелец)=Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	(НЕ Номенклатура.ЭтоГруппа)
		|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ВидНоменклатуры", Источник.Объект.Владелец);
		
		ВладельцыХарактеристики = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		
		Если ЗначениеЗаполнено(Источник.Объект) Тогда
			ВладельцыХарактеристики.Добавить(Источник.Объект.Владелец);
		КонецЕсли;
		
	КонецЕсли;
	
КонецЕсли;

МассивУникальныхИдентификаторовВладельцев = Новый Массив;

Для каждого ТекСтрока Из ВладельцыХарактеристики Цикл
	
	МассивУникальныхИдентификаторовВладельцев.Добавить(Строка(ТекСтрока.УникальныйИдентификатор()));
	
КонецЦикла;

Значение = ЗначениеВСтрокуВнутр(МассивУникальныхИдентификаторовВладельцев);
