Если Не Источник.ЭтоГруппа Тогда

	НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);

	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Тип,
		|	КонтактнаяИнформация.Вид
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект";
		
	Запрос.УстановитьПараметр("Объект", Источник.Ссылка);
		
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей.Отбор.Тип.Установить(Выборка.Тип);
		НаборЗаписей.Отбор.Вид.Установить(Выборка.Вид);
		
		ВыгрузитьПоПравилу(Выборка.Вид);
		
		НаборЗаписей.Прочитать();
		
		ВыгрузитьРегистр(НаборЗаписей,,,,"КонтактнаяИнформация");
		
	КонецЦикла;
	
КонецЕсли;
