Запрос = Новый Запрос("
|ВЫБРАТЬ
|	Штрихкоды.Штрихкод КАК Штрихкод,
|	Штрихкоды.Владелец КАК Номенклатура,
|	Штрихкоды.ЕдиницаИзмерения КАК Упаковка,
|	Штрихкоды.ХарактеристикаНоменклатуры КАК Характеристика
|ИЗ
|	РегистрСведений.Штрихкоды КАК Штрихкоды
|ГДЕ
|	Штрихкоды.Владелец ССЫЛКА Справочник.Номенклатура
|	И ВЫРАЗИТЬ(Штрихкоды.Владелец КАК Справочник.Номенклатура).ВидНоменклатуры.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
|	   ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))
|");

ВыборкаДанных = Запрос;
