
//нужные переменные
МетаданныеДокумента  = Объект.Метаданные();
ИскомыйСклад         = Справочники.Склады.ПустаяСсылка();
ИскомоеПодразделение = Справочники.Подразделения.ПустаяСсылка();

/// ШАПКА 

//получим нужные поля по коду магазина
ИмяПараметра = "КодМагазина";
Выполнить(Алгоритмы.ОпределитьПараметрыМагазина);

//общие реквизиты шапки
Выполнить(Алгоритмы.ОбработкаШапки);

//заполним поле договор
ДокументОбъект                  = Объект;
ВалютаРегламентированногоУчета  = Константы.ВалютаРегламентированногоУчета.Получить();
ВидДоговора                     = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
КонтрагентПараметр              = Объект.Контрагент;
ОрганизацияПараметр             = Объект.Организация;
ДатаПараметр                    = Объект.Дата;
ДоговорВТабличнойЧасти          = Ложь;
Выполнить(Алгоритмы.УстановитьДоговорПоКонтрагенту);

//наличие\отсутствиие ордерной схемы
Если ПараметрыОбъекта["ИспользованиеОрдернойСхемы"] Тогда
	
	УИд = ПараметрыОбъекта["СсылкаНаПриходныйОрдерНаТовары"];
	Если НЕ УИд = Неопределено Тогда
		СсылкаНаПриходныйОрдерНаТовары = Документы.ПриходныйОрдерНаТовары.ПолучитьСсылку(Новый УникальныйИдентификатор(УИд));
		Если СсылкаНаПриходныйОрдерНаТовары.ПолучитьОбъект() <> Неопределено Тогда
			
			Объект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру;
			
			Объект.СкладОрдер = СсылкаНаПриходныйОрдерНаТовары;
			
			//во всех строках расставляем ПО
			Для Каждого СтрокаТовары Из Объект.Товары Цикл
				СтрокаТовары.ПриходныйОрдер = СсылкаНаПриходныйОрдерНаТовары;
			КонецЦикла;
		Иначе
		Объект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;	
		КонецЕсли;
	Иначе
	Объект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;	
	КонецЕсли;
Иначе
	Объект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
	
	//заполним поле склад
	Если Не ИскомыйСклад.Пустая() Тогда
		Объект.СкладОрдер = ИскомыйСклад;
	КонецЕсли;

КонецЕсли;

/// ТАБЛИЧНАЯ ЧАСТЬ

// Обработаем стандартно табличную часть докумета
ИмяТабличнойЧасти = "Товары";
ДокументОбъект = Объект;
Выполнить(Алгоритмы.ОбработкаТабличнойЧасти);

ИмяТабличнойЧасти = "СоставНабора";
ДокументОбъект = Объект;
Выполнить(Алгоритмы.ОбработкаТабличнойЧасти);

//заполним склад в табличной части тем же складом, который указан в шапке
Для Каждого СтрокаДокумента Из Объект.Товары Цикл
	СтрокаДокумента.Склад = Объект.СкладОрдер;
КонецЦикла;



Выполнить(Алгоритмы.УстановитьВозможностьРедактированияОбъекта);
