Запрос = Новый Запрос("
|ВЫБРАТЬ
|	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.ДокументОприходования.Организация,                             ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))          КАК Организация,
|	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента,                      ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ДоговорКонтрагента,
|	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент,                              ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))          КАК Контрагент,
|	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента.ВалютаВзаиморасчетов, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))               КАК ВалютаВзаиморасчетов,
|	ПартииТоваровНаСкладахОстатки.Склад                       КАК Склад,
|	ПартииТоваровНаСкладахОстатки.Номенклатура                КАК Номенклатура,
|	ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры  КАК Характеристика,
|	ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.НомерГТД             КАК НомерГТД,
|	ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.СтранаПроисхождения  КАК СтранаПроисхождения,
|	ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.ПометкаУдаления      КАК ПометкаУдаления,
|	СУММА(ПартииТоваровНаСкладахОстатки.КоличествоОстаток * ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1)) КАК Количество,
|	ПартииТоваровНаСкладахОстатки.ДокументОприходования
|ИЗ
|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
|			&ДатаОстатков,
|			СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартийТоваров.НаКомиссию)
|				И Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)) КАК ПартииТоваровНаСкладахОстатки
|
|СГРУППИРОВАТЬ ПО
|	ПартииТоваровНаСкладахОстатки.Номенклатура,
|	ПартииТоваровНаСкладахОстатки.Склад,
|	ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры,
|	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.ДокументОприходования.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)),
|	ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.НомерГТД,
|	ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.СтранаПроисхождения,
|	ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.ПометкаУдаления,
|	ПартииТоваровНаСкладахОстатки.ДокументОприходования,
|	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент,                              ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)),
|	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента,                      ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)),
|	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента.ВалютаВзаиморасчетов, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
|
|УПОРЯДОЧИТЬ ПО
|	ПартииТоваровНаСкладахОстатки.Склад.Наименование, 	
|	ПартииТоваровНаСкладахОстатки.Номенклатура.Наименование, 	
|	ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры.Наименование 	
| 
|ИТОГИ ПО
|	Организация,
|	Склад,
|	ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент,
|	ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента
|");

Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(Параметры.ДатаОстатков));

ВыборкаДанных = Новый ТаблицаЗначений;
ВыборкаДанных.Колонки.Добавить("Дата");
ВыборкаДанных.Колонки.Добавить("Организация");
ВыборкаДанных.Колонки.Добавить("Склад");
ВыборкаДанных.Колонки.Добавить("Партнер");
ВыборкаДанных.Колонки.Добавить("СоглашениеСКомитентом");
ВыборкаДанных.Колонки.Добавить("Валюта");
ВыборкаДанных.Колонки.Добавить("Товары");

РезультатыЗапроса = Запрос.Выполнить();
ВыборкаПоОрганизациям = РезультатыЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
Пока ВыборкаПоОрганизациям.Следующий() Цикл
	
	ВыборкаПоСкладам = ВыборкаПоОрганизациям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСкладам.Следующий() Цикл
		
		ВыборкаПоКонтрагентам = ВыборкаПоСкладам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоКонтрагентам.Следующий() Цикл
			
			ВыборкаПоДоговорамКонтрагента = ВыборкаПоКонтрагентам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоДоговорамКонтрагента.Следующий() Цикл
				
				НоваяСтрока = ВыборкаДанных.Добавить();
				НоваяСтрока.Дата                  = КонецДня(Параметры.ДатаОстатков); 
				НоваяСтрока.Организация           = ВыборкаПоОрганизациям.Организация; 
				НоваяСтрока.Склад                 = ВыборкаПоСкладам.Склад; 
				НоваяСтрока.Партнер               = ВыборкаПоКонтрагентам.Контрагент; 
				НоваяСтрока.СоглашениеСКомитентом = ВыборкаПоДоговорамКонтрагента.ДоговорКонтрагента; 
				НоваяСтрока.Валюта                = ВыборкаПоДоговорамКонтрагента.ВалютаВзаиморасчетов; 
				
				НоваяСтрока.Товары = Новый ТаблицаЗначений;
				НоваяСтрока.Товары.Колонки.Добавить("Номенклатура");
				НоваяСтрока.Товары.Колонки.Добавить("Характеристика");
				НоваяСтрока.Товары.Колонки.Добавить("Количество");
				НоваяСтрока.Товары.Колонки.Добавить("НомерГТД");
				
				ВыборкаДетальныеЗаписи = ВыборкаПоДоговорамКонтрагента.Выбрать(); 
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если ВыборкаДетальныеЗаписи.Количество < 0.00 Тогда
						СтрокаСообщения = "Обнаружен отрицательный остаток на складе ""%1"" по товару ""%2"" при выгрузке по правилу: ""%3""";
						СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1", ВыборкаПоСкладам.Склад);
						СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2", ВыборкаДетальныеЗаписи.Номенклатура);
						СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3", "Ввод остатков товаров, принятых на комиссию");
						Сообщить(СтрокаСообщения, СтатусСообщения.ОченьВажное);
						Продолжить;
					КонецЕсли;
					
					НоваяСтрокаТовары = НоваяСтрока.Товары.Добавить();	
					НоваяСтрокаТовары.Номенклатура       = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрокаТовары.Характеристика     = ВыборкаДетальныеЗаписи.Характеристика;
					НоваяСтрокаТовары.Количество         = ВыборкаДетальныеЗаписи.Количество;
						
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НомерГТД) Тогда
						НоваяСтрокаТовары.НомерГТД = Новый Структура;
						НоваяСтрокаТовары.НомерГТД.Вставить("Владелец", ВыборкаДетальныеЗаписи.Номенклатура);
						НоваяСтрокаТовары.НомерГТД.Вставить("СтранаПроисхождения", ВыборкаДетальныеЗаписи.СтранаПроисхождения);
						НоваяСтрокаТовары.НомерГТД.Вставить("ПометкаУдаления", ВыборкаДетальныеЗаписи.ПометкаУдаления);
						НоваяСтрокаТовары.НомерГТД.Вставить("Код", ВыборкаДетальныеЗаписи.НомерГТД);
					КонецЕсли;
					
				КонецЦикла;
				
				Если НоваяСтрока.Товары.Количество() = 0 Тогда
					ВыборкаДанных.Удалить(НоваяСтрока);	
				Иначе
					НоваяСтрока.Товары.Свернуть("Номенклатура,Характеристика,НомерГТД","Количество");
				КонецЕсли;
			
			КонецЦикла;
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецЦикла;
