Если ТипЗнч(Источник) <> Тип("Структура") Тогда
		
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец В (
	|		ВЫБРАТЬ
	|			Ссылка
	|		ИЗ
	|			Справочник.Номенклатура
	|		ГДЕ
	|			ВидНоменклатуры = &ВидНоменклатуры)
	|");

	Запрос.УстановитьПараметр("ВидНоменклатуры", Источник.Ссылка);

	Если Запрос.Выполнить().Пустой() Тогда
		Значение = "НеИспользовать";
	Иначе
		Значение = "ИндивидуальныеДляНоменклатуры";
	КонецЕсли;

КонецЕсли;
