
ВозможностьРедактирования = Истина;

Для Каждого СтрокаТЧ ИЗ Источник.Товары Цикл
	Если ЗначениеЗаполнено(СтрокаТЧ.Продавец) Тогда
		ВозможностьРедактирования = Ложь;
		Прервать;
	КонецЕсли;
КонецЦикла;

Для Каждого СтрокаТЧ Из Источник.ПродажиПоДисконтнымКартам Цикл
	Если ТипЗнч(СтрокаТЧ.ВладелецДисконтнойКарты) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ВозможностьРедактирования = Ложь;
		Прервать;
	КонецЕсли;
КонецЦикла;

Если ВозможностьРедактирования Тогда
	Значение = Истина;
Иначе
	Значение = Ложь;
КонецЕсли;
