

//нужные переменные
МетаданныеДокумента  = Объект.Метаданные();
ИскомоеПодразделение = Справочники.Подразделения.ПустаяСсылка();
ИскомыйСклад         = Справочники.Склады.ПустаяСсылка();
ИскомаяОрганизация   = Справочники.Организации.ПустаяСсылка();

/// ШАПКА 

//получим нужные поля по коду магазина
ИмяПараметра = "КодМагазина";
Выполнить(Алгоритмы.ОпределитьПараметрыМагазина);

//общие реквизиты шапки
Выполнить(Алгоритмы.ОбработкаШапки);

Если Не ЗначениеЗаполнено(Объект.ВидЗаказа) Тогда
	Объект.ВидЗаказа = Перечисления.ВидыВнутреннегоЗаказа.НаСклад;
КонецЕсли;

//заполним склад
Если Не ИскомыйСклад.Пустая() Тогда
	Объект.Заказчик = ИскомыйСклад;
КонецЕсли;

Если Не ИскомаяОрганизация.Пустая() И Не ЗначениеЗаполнено(Объект.Организация) Тогда
	Объект.Организация = ИскомаяОрганизация;
КонецЕсли;

Если Не ИскомоеПодразделение.Пустая() И Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
	Объект.Подразделение = ИскомоеПодразделение;
КонецЕсли;

/// ТАБЛИЧНАЯ ЧАСТЬ

//работа с табличными частями
ИмяТабличнойЧасти = "Товары";
ДокументОбъект = Объект;
Выполнить(Алгоритмы.ОбработкаТабличнойЧасти);
