Запрос = Новый Запрос("
|ВЫБРАТЬ
|	Док.ТипЦен                     КАК ТипЦен,
|	Док.Номенклатура               КАК Номенклатура,
|	Док.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
|
|	ВЫРАЗИТЬ(Док.Цена
|	 * ВЫБОР
|		КОГДА Док.ТипЦен.ВалютаЦены <> Док.Валюта
|			ТОГДА
|				ВЫБОР
|					КОГДА
|						ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.Кратность, 0) > 0
|						И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.Курс, 0) > 0
|						И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Кратность, 0) > 0
|						И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Курс, 0) > 0
|							ТОГДА КурсыСрезПоследнихВалютаЦены.Курс * КурсыСрезПоследнихВалютаДокумента.Кратность / (КурсыСрезПоследнихВалютаДокумента.Курс * КурсыСрезПоследнихВалютаЦены.Кратность)
|					ИНАЧЕ 0
|				КОНЕЦ
|		ИНАЧЕ 1
|	КОНЕЦ КАК Число(10,2)) КАК Цена,
|	
|	Док.ЕдиницаИзмерения КАК ЕдиницаИзмерения
|ИЗ
|	Документ.УстановкаЦенНоменклатуры.Товары КАК Док
|	
|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыСрезПоследнихВалютаЦены
|	ПО (КурсыСрезПоследнихВалютаЦены.Валюта = Док.Валюта)
|	
|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыСрезПоследнихВалютаДокумента
|	ПО (КурсыСрезПоследнихВалютаДокумента.Валюта = Док.ТипЦен.ВалютаЦены)
|
|ГДЕ
|	Док.Ссылка = &Док
|	И (Док.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
|	   Или Док.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))
|УПОРЯДОЧИТЬ ПО
|	Док.НомерСтроки
|");

Запрос.УстановитьПараметр("Док",  Источник);
Запрос.УстановитьПараметр("ДатаДокумента", Источник.Дата);

КоллекцияОбъектов = Запрос.Выполнить().Выгрузить();
