МетаданныеДокумента  = Объект.Метаданные();
ИскомоеПодразделение = Справочники.Подразделения.ПустаяСсылка();

/// ШАПКА 

//общие реквизиты шапки
Выполнить(Алгоритмы.ОбработкаШапки);


/// ТАБЛИЧНАЯ ЧАСТЬ

//работа с табличными частями
ИмяТабличнойЧасти = "Товары";
ДокументОбъект = Объект;
Выполнить(Алгоритмы.ОбработкаТабличнойЧасти);

//установим валюту и способ расчета цены
ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
Для Каждого СтрокаТовары Из Объект.Товары Цикл
	Если Не ЗначениеЗаполнено(СтрокаТовары.Валюта) Тогда
		СтрокаТовары.Валюта = ВалютаРегламентированногоУчета;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтрокаТовары.СпособРасчетаЦены) Тогда
		СтрокаТовары.СпособРасчетаЦены = Перечисления.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип;
	КонецЕсли;
КонецЦикла;
