ПровестиЗаписьНеЗаписанныхОбъектов();

Для Каждого Запись Из Объект Цикл
	
	// Получим наименование характеристики товара
	НаименованиеХарактеристикиНоменклатуры = ПараметрыОбъекта["НаименованиеХарактеристикиНоменклатуры"];
	
	// Производим поиск характеристики товара
    Если НРег(СокрЛП(НаименованиеХарактеристикиНоменклатуры)) <> "не назначена" Тогда

	Если НЕ(ЗначениеЗаполнено(Запись.ХарактеристикаНоменклатуры) ИЛИ ПустаяСтрока(НаименованиеХарактеристикиНоменклатуры)) Тогда
		
		Запись.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(НаименованиеХарактеристикиНоменклатуры, Истина,, Запись.Номенклатура);
		
		// Если не удалось найти - создаем новый элемент
		Если НЕ ЗначениеЗаполнено(Запись.ХарактеристикаНоменклатуры) И ЗначениеЗаполнено(Запись.Номенклатура) Тогда
			
			ХарактеристикаНоменклатурыОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			ХарактеристикаНоменклатурыОбъект.Владелец     = Запись.Номенклатура;
			ХарактеристикаНоменклатурыОбъект.Наименование = НаименованиеХарактеристикиНоменклатуры;
			ХарактеристикаНоменклатурыОбъект.ОбменДанными.Загрузка = Истина;
			ХарактеристикаНоменклатурыОбъект.Записать();
			Запись.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатурыОбъект.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КонецЕсли;
	// Получим наименование характеристики товара
	НаименованиеХарактеристикиКомплектующей = ПараметрыОбъекта["НаименованиеХарактеристикиКомплектующей"];
	
	// Производим поиск характеристики товара
	Если НРег(СокрЛП(НаименованиеХарактеристикиКомплектующей)) <> "не назначена" Тогда
		
	Если НЕ(ЗначениеЗаполнено(Запись.ХарактеристикаКомплектующей) ИЛИ ПустаяСтрока(НаименованиеХарактеристикиКомплектующей)) Тогда
		
		Запись.ХарактеристикаКомплектующей = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(НаименованиеХарактеристикиКомплектующей, Истина,, Запись.Комплектующая);
		
		// Если не удалось найти - создаем новый элемент
		Если НЕ ЗначениеЗаполнено(Запись.ХарактеристикаКомплектующей) И ЗначениеЗаполнено(Запись.Комплектующая) Тогда
			
			ХарактеристикаНоменклатурыОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			ХарактеристикаНоменклатурыОбъект.Владелец     = Запись.Комплектующая;
			ХарактеристикаНоменклатурыОбъект.Наименование = НаименованиеХарактеристикиКомплектующей;
			ХарактеристикаНоменклатурыОбъект.ОбменДанными.Загрузка = Истина;
			ХарактеристикаНоменклатурыОбъект.Записать();
			Запись.ХарактеристикаКомплектующей = ХарактеристикаНоменклатурыОбъект.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КонецЕсли;

	// Внесем изменения в параметры отбора
	Объект.Отбор.ХарактеристикаНоменклатуры .Установить(Запись.ХарактеристикаНоменклатуры,  Истина);
	Объект.Отбор.Комплектующая              .Установить(Запись.Комплектующая,               Истина);
	Объект.Отбор.ХарактеристикаКомплектующей.Установить(Запись.ХарактеристикаКомплектующей, Истина);
	
КонецЦикла;
