
// Если вид информационной карты - "Смешанная" то выполняем замену
// на значение, указанное в реквизите плана обмена плане обмена
// ВидИнформационнойКартыСмешаннаяВУТ

Если Источник.ВидКарты = Перечисления.ВидыИнформационныхКарт.Смешанная Тогда
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Узел.ВидИнформационнойКартыСмешаннаяВУТ
	|ИЗ
	|	ПланОбмена.ОбменУправлениеТорговлейРозничнаяТорговля КАК Узел
	|ГДЕ
	|	Узел.Ссылка = &УзелПланаОбмена";
	Запрос.УстановитьПараметр("УзелПланаОбмена", Параметры.УзелОбмена);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Значение = Выборка.ВидИнформационнойКартыСмешаннаяВУТ;
	Иначе
		Значение = Перечисления.ВидыИнформационныхКарт.ПустаяСсылка();
	КонецЕсли;
	
	// Необходимо запретить изменять данную информационную карту в УТ
	// Для этого существует свойство ПКО ЭтоСмешаннаяИнформационнаяКарта
	
КонецЕсли;
