

//нужные переменные
МетаданныеДокумента  = Объект.Метаданные();
ИскомоеПодразделение = Справочники.Подразделения.ПустаяСсылка();

/// ШАПКА 

//заполним кассу отправитель
ИмяПараметра = "КодМагазинаОтправителя";
ИскомаяКасса = Справочники.Кассы.ПустаяСсылка();
Выполнить(Алгоритмы.ОпределитьПараметрыМагазина);
Если Не ИскомаяКасса.Пустая() Тогда
	Объект.Касса = ИскомаяКасса;
КонецЕсли;

//общие реквизиты шапки
Выполнить(Алгоритмы.ОбработкаШапки);

//заполним кассу получатель
ИмяПараметра = "КодМагазинаПолучателя";
ИскомаяКасса = Справочники.Кассы.ПустаяСсылка();
Выполнить(Алгоритмы.ОпределитьПараметрыМагазина);
Если Не ИскомаяКасса.Пустая() Тогда
	Объект.КассаПолучатель = ИскомаяКасса;
КонецЕсли;

//валюта документа
Объект.ВалютаДокумента = Объект.Касса.ВалютаДенежныхСредств;
