Если СвойстваПоиска["ЭтоГруппа"] = Истина Тогда
	
	Если ЗначениеЗаполнено(НастройкаПоиска) Тогда
		
		Если НастройкаПоиска = "Ссылка" Тогда
			
			ПрекратитьПоиск = Истина;
			
		Иначе
			
			СтрокаИменСвойствПоиска = "Наименование, ЭтоГруппа";
			
		КонецЕсли;
		
	Иначе
		
		СтрокаИменСвойствПоиска = "Наименование, ЭтоГруппа";
		
	КонецЕсли;

	
Иначе
	
	Если НастройкаПоиска = "Наименование" Тогда
		
		СтрокаИменСвойствПоиска = "Наименование, ЭтоГруппа";
		
	ИначеЕсли НастройкаПоиска = "Ссылка" Тогда
		
		ПрекратитьПоиск = Истина;
		
	ИначеЕсли НастройкаПоиска = "ИННКПП" Тогда
		
		Если ЗначениеЗаполнено(СвойстваПоиска["ИНН"]) Тогда
			СтрокаИменСвойствПоиска = "ИНН, КПП, ЭтоГруппа";
		Иначе
			СтрокаИменСвойствПоиска = "Наименование, НаименованиеПолное, ЭтоГруппа";
		КонецЕсли;
		
	Иначе // По ссылке
		
		//ПрекратитьПоиск = Истина;
		
	КонецЕсли;
	
КонецЕсли;
