
// ...Из модуля объекта УТ 11
ТекстСерия				= НСтр("ru = ', серия: %1'");
ТекстНомер				= НСтр("ru = ', № %1'");
ТекстДатаВыдачи			= НСтр("ru = ', выдан: %1 года'");
ТекстСрокДействия		= НСтр("ru = ', действует до: %1 года'");
ТекстКодПодразделения	= НСтр("ru = ', № подр. %1'");

Если Объект.ВидДокумента.Пустая() Тогда
	Объект.Представление = "";
	
Иначе
	Объект.Представление = ""
		+ Объект.ВидДокумента
		+ ?(ЗначениеЗаполнено(Объект.Серия), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСерия, Объект.Серия), "")
		+ ?(ЗначениеЗаполнено(Объект.Номер), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстНомер, Объект.Номер), "")
		+ ?(ЗначениеЗаполнено(Объект.ДатаВыдачи), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДатаВыдачи, Формат(Объект.ДатаВыдачи,"ДФ='дд ММММ гггг'")), "")
		+ ?(ЗначениеЗаполнено(Объект.СрокДействия), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСрокДействия, Формат(Объект.СрокДействия,"ДФ='дд ММММ гггг'")), "")
		+ ?(ЗначениеЗаполнено(Объект.КемВыдан), ", " + Объект.КемВыдан, "")
		+ ?(ЗначениеЗаполнено(Объект.КодПодразделения) И Объект.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстКодПодразделения, Объект.КодПодразделения), "");
	
КонецЕсли;
