


//нужные переменные
МетаданныеДокумента  = Объект.Метаданные();
ИскомоеПодразделение = Справочники.Подразделения.ПустаяСсылка();
ИскомыйСклад         = Справочники.Склады.ПустаяСсылка();

/// ШАПКА 

//получим нужные поля по коду магазина
ИмяПараметра = "КодМагазина";
Выполнить(Алгоритмы.ОпределитьПараметрыМагазина);

//общие реквизиты шапки
Выполнить(Алгоритмы.ОбработкаШапки);

//проверим, что контрагент - покупатель
Если Не Объект.Контрагент.Пустая() И Не Объект.Контрагент.Покупатель Тогда
	Контрагент = Объект.Контрагент.ПолучитьОбъект();
	Если Контрагент <> Неопределено Тогда
		Контрагент.Покупатель = Истина;
		Контрагент.Записать();
	КонецЕсли;
КонецЕсли;

//заполним поле договор
ДокументОбъект                  = Объект;
ВалютаРегламентированногоУчета  = Параметры.ВалютаРегламентированногоУчета;
ВидДоговора                     = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
КонтрагентПараметр              = Объект.Контрагент;
ОрганизацияПараметр             = Объект.Организация;
ДоговорВТабличнойЧасти          = Ложь;
ДатаПараметр                    = Объект.Дата;
Выполнить(Алгоритмы.УстановитьДоговорПоКонтрагенту);

//заполним вид операции
Объект.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;

//вид передачи
Если ПараметрыОбъекта["ИспользованиеОрдернойСхемы"] Тогда
	Объект.ВидПередачи = Перечисления.ВидыПередачиТоваров.ПоОрдеру;
Иначе
	Объект.ВидПередачи = Перечисления.ВидыПередачиТоваров.СоСклада;
КонецЕсли;

//вид передачи и склад
Если Не ИскомыйСклад.Пустая() Тогда
	Объект.Склад = ИскомыйСклад;
КонецЕсли;


/// ТАБЛИЧНАЯ ЧАСТЬ

//заполним единицы измерения и, если нужно, номенклатуру (по характеристике)
ИмяТабличнойЧасти = "Товары";
ДокументОбъект = Объект;
Выполнить(Алгоритмы.ОбработкаТабличнойЧасти);

ИмяТабличнойЧасти = "СоставНабора";
ДокументОбъект = Объект;
Выполнить(Алгоритмы.ОбработкаТабличнойЧасти);


ИмяТабличнойЧасти = "Услуги";
ДокументОбъект = Объект;
Выполнить(Алгоритмы.ОбработкаТабличнойЧасти);
//заполним склад в табличной части тем же складом, который указан в шапке
Для Каждого СтрокаДокумента Из Объект.Товары Цикл
	СтрокаДокумента.Склад = Объект.Склад;
	СтрокаДокумента.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
КонецЦикла;
