Запрос = Новый Запрос("
|ВЫБРАТЬ
|	&ДатаОстатков                                                              КАК ДатаПлатежа,
|	ВзаиморасчетыСКонтрагентамиОстатки.Организация                             КАК Организация,
|	ВзаиморасчетыСКонтрагентамиОстатки.Сделка                                  КАК Сделка,
|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент                              КАК Партнер,
|	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток             КАК Сумма,
|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта
|ИЗ
|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ДатаОстатков, ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)) КАК ВзаиморасчетыСКонтрагентамиОстатки
|ГДЕ
|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВедениеВзаиморасчетов <> ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам)
|	И ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток < 0
|	И НЕ ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	&ДатаОстатков                                                                                  КАК ДатаПлатежа,
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация                             КАК Организация,
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом           КАК ДокументРасчетовСКонтрагентом,
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент                              КАК Партнер,
|	-ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток             КАК Сумма,
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта
|ИЗ                                                                                   
|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(&ДатаОстатков, ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
|ГДЕ
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток < 0
|	И ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.УпрУчет
|	И ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ВедениеВзаиморасчетов <> ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам)
|	И НЕ (ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом ССЫЛКА Документ.ПоступлениеТоваровУслуг 
|		  ИЛИ ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ)
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	&ДатаОстатков                                                              КАК ДатаПлатежа,
|	ВзаиморасчетыСКонтрагентамиОстатки.Организация                             КАК Организация,
|	ВзаиморасчетыСКонтрагентамиОстатки.Сделка                                  КАК Сделка,
|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент                              КАК Партнер,
|	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток             КАК Сумма,
|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта
|ИЗ
|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ДатаОстатков, ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентом)) КАК ВзаиморасчетыСКонтрагентамиОстатки
|ГДЕ
|	НЕ ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом
|	И ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток < 0
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	&ДатаОстатков                                                                                  КАК ДатаПлатежа,
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация                             КАК Организация,
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом           КАК ДокументРасчетовСКонтрагентом,
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент                              КАК Партнер,
|	-ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток             КАК Сумма,
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта
|ИЗ                                                                                   
|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(&ДатаОстатков, ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентом)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
|ГДЕ
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток < 0
|	И ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.УпрУчет
|	И НЕ ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом ССЫЛКА Документ.ОтчетКомитентуОПродажах
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	&ДатаОстатков                                                              КАК ДатаПлатежа,
|	ВзаиморасчетыСКонтрагентамиОстатки.Организация                             КАК Организация,
|	ВзаиморасчетыСКонтрагентамиОстатки.Сделка                                  КАК Сделка,
|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент                              КАК Партнер,
|	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток             КАК Сумма,
|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта
|ИЗ
|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ДатаОстатков, ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)) КАК ВзаиморасчетыСКонтрагентамиОстатки
|ГДЕ
|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток < 0
|
|УПОРЯДОЧИТЬ ПО
|	Партнер 	
|
|ИТОГИ ПО
|	Организация
|");

Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(Параметры.ДатаОстатков));

ВыборкаДанных = Новый ТаблицаЗначений;
ВыборкаДанных.Колонки.Добавить("Дата");
ВыборкаДанных.Колонки.Добавить("Организация");
ВыборкаДанных.Колонки.Добавить("РасчетыСПартнерами");

РезультатыЗапроса = Запрос.Выполнить();
ВыборкаПоОрганизациям = РезультатыЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
Пока ВыборкаПоОрганизациям.Следующий() Цикл
	
	НоваяСтрока = ВыборкаДанных.Добавить();
	НоваяСтрока.Дата        = КонецДня(Параметры.ДатаОстатков); 
	НоваяСтрока.Организация = ВыборкаПоОрганизациям.Организация; 
	
	НоваяСтрока.РасчетыСПартнерами = Новый ТаблицаЗначений;
	НоваяСтрока.РасчетыСПартнерами.Колонки.Добавить("Партнер");
	НоваяСтрока.РасчетыСПартнерами.Колонки.Добавить("Контрагент");
	НоваяСтрока.РасчетыСПартнерами.Колонки.Добавить("Сумма");
	НоваяСтрока.РасчетыСПартнерами.Колонки.Добавить("Валюта");
	НоваяСтрока.РасчетыСПартнерами.Колонки.Добавить("ДатаПлатежа");
	
	ВыборкаДетальныеЗаписи = ВыборкаПоОрганизациям.Выбрать(); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрокаРасчетыСПартнерами = НоваяСтрока.РасчетыСПартнерами.Добавить();	
		НоваяСтрокаРасчетыСПартнерами.Партнер                  = ВыборкаДетальныеЗаписи.Партнер;
		НоваяСтрокаРасчетыСПартнерами.Контрагент               = ВыборкаДетальныеЗаписи.Партнер;
		НоваяСтрокаРасчетыСПартнерами.Сумма                    = ВыборкаДетальныеЗаписи.Сумма;
		НоваяСтрокаРасчетыСПартнерами.Валюта                   = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрокаРасчетыСПартнерами.ДатаПлатежа              = ВыборкаДетальныеЗаписи.ДатаПлатежа;
		
	КонецЦикла;
	
	НоваяСтрока.РасчетыСПартнерами.Свернуть("Партнер, Контрагент, Валюта, ДатаПлатежа", "Сумма");
	
КонецЦикла;
