Запрос = Новый Запрос("
|ВЫБРАТЬ
|	ВзаиморасчетыСКонтрагентамиОстатки.Организация                                         КАК Организация,
|	ВзаиморасчетыСКонтрагентамиОстатки.Сделка                                              КАК Сделка,
|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент                                          КАК Партнер,
|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток                          КАК Сумма,
|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов             КАК Валюта
|ИЗ
|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ДатаОстатков, ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)) КАК ВзаиморасчетыСКонтрагентамиОстатки
|ГДЕ
|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВедениеВзаиморасчетов <> ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам)
|	И ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
|	И НЕ ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация                             КАК Организация,
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом           КАК ДокументРасчетовСКонтрагентом,
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент                              КАК Партнер,
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток              КАК Сумма,
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта
|ИЗ                                                                                   
|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(&ДатаОстатков, ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
|ГДЕ
|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток > 0
|	И ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.УпрУчет
|	И ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ВедениеВзаиморасчетов <> ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам)
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВзаиморасчетыСКонтрагентамиОстатки.Организация                                         КАК Организация,
|	ВзаиморасчетыСКонтрагентамиОстатки.Сделка                                              КАК Сделка,
|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент                                          КАК Партнер,
|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток                          КАК Сумма,
|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов             КАК Валюта
|ИЗ
|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ДатаОстатков, ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)) КАК ВзаиморасчетыСКонтрагентамиОстатки
|ГДЕ
|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам)
|	И ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
|	И Не ВзаиморасчетыСКонтрагентамиОстатки.Сделка ССЫЛКА Документ.ЗаказПоставщику 
|
|УПОРЯДОЧИТЬ ПО
|	Партнер 	
|
|ИТОГИ ПО
|	Организация
|");

Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(Параметры.ДатаОстатков));

ВыборкаДанных = Новый ТаблицаЗначений;
ВыборкаДанных.Колонки.Добавить("Дата");
ВыборкаДанных.Колонки.Добавить("Организация");
ВыборкаДанных.Колонки.Добавить("РасчетыСПартнерами");

РезультатыЗапроса = Запрос.Выполнить();
ВыборкаПоОрганизациям = РезультатыЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
Пока ВыборкаПоОрганизациям.Следующий() Цикл
	
	НоваяСтрока = ВыборкаДанных.Добавить();
	НоваяСтрока.Дата        = КонецДня(Параметры.ДатаОстатков); 
	НоваяСтрока.Организация = ВыборкаПоОрганизациям.Организация; 
	
	НоваяСтрока.РасчетыСПартнерами = Новый ТаблицаЗначений;
	НоваяСтрока.РасчетыСПартнерами.Колонки.Добавить("Партнер");
	НоваяСтрока.РасчетыСПартнерами.Колонки.Добавить("Контрагент");
	НоваяСтрока.РасчетыСПартнерами.Колонки.Добавить("Сумма");
	НоваяСтрока.РасчетыСПартнерами.Колонки.Добавить("Валюта");
	
	ВыборкаДетальныеЗаписи = ВыборкаПоОрганизациям.Выбрать(); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрокаРасчетыСПартнерами = НоваяСтрока.РасчетыСПартнерами.Добавить();	
		НоваяСтрокаРасчетыСПартнерами.Партнер                  = ВыборкаДетальныеЗаписи.Партнер;
		НоваяСтрокаРасчетыСПартнерами.Контрагент               = ВыборкаДетальныеЗаписи.Партнер;
		НоваяСтрокаРасчетыСПартнерами.Сумма                    = ВыборкаДетальныеЗаписи.Сумма;
		НоваяСтрокаРасчетыСПартнерами.Валюта                   = ВыборкаДетальныеЗаписи.Валюта;
		
	КонецЦикла;
	
	НоваяСтрока.РасчетыСПартнерами.Свернуть("Партнер, Контрагент, Валюта", "Сумма");
	
КонецЦикла;
