
МетаданныеДокумента  = Объект.Метаданные();
ИскомоеПодразделение = Справочники.Подразделения.ПустаяСсылка();
ИскомыйСклад         = Справочники.Склады.ПустаяСсылка();
ИскомаяОрганизация   = Справочники.Организации.ПустаяСсылка();


/// ШАПКА 

//получим нужные поля по коду магазина
ИмяПараметра = "КодМагазина";
Выполнить(Алгоритмы.ОпределитьПараметрыМагазина);

Если ИскомыйСклад.ВидСклада <> Перечисления.ВидыСкладов.Розничный Тогда
	Отказ = Истина;
КонецЕсли;

//общие реквизиты шапки
Выполнить(Алгоритмы.ОбработкаШапки);

Объект.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВРознице;

//заполним склад
Если Не ИскомыйСклад.Пустая() Тогда
	Объект.Склад = ИскомыйСклад;
КонецЕсли;

Если Не ИскомаяОрганизация.Пустая() И Не ЗначениеЗаполнено(Объект.Организация) Тогда
	Объект.Организация = ИскомаяОрганизация;
КонецЕсли;

/// ТАБЛИЧНАЯ ЧАСТЬ

//работа с табличными частями
ИмяТабличнойЧасти = "Товары";
ДокументОбъект = Объект;
Выполнить(Алгоритмы.ОбработкаТабличнойЧасти);
