Если Не ЗначениеЗаполнено(Объект.НалогообложениеНДС) Тогда
	Объект.НалогообложениеНДС = Справочники.Организации.НалогообложениеНДС(Объект.Организация, Неопределено, ТекущаяДата());
КонецЕсли;
Выполнить(Алгоритмы.УстановитьМенеджераВДокумент);


Для каждого ТекущаяСтрока Из Объект.Товары Цикл
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",  Объект.НалогообложениеНДС);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект));
	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	ОбработкаТабличнойЧастиТоварыСервер.ОбработатьСтрокуТЧСервер(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецЦикла;

Объект.ЗаполнитьЭтапыГрафикаОплаты();

Если ПараметрыОбъекта <> Неопределено Тогда
	Если Объект.ЭтапыГрафикаОплаты.Количество() = 1 И ЗначениеЗаполнено(ПараметрыОбъекта.Получить("ДатаОплаты")) Тогда
		Если Объект.ЖелаемаяДатаОтгрузки < ПараметрыОбъекта.Получить("ДатаОплаты") Тогда
			Объект.ЭтапыГрафикаОплаты[0].ДатаПлатежа = ПараметрыОбъекта.Получить("ДатаОплаты");
		КонецЕсли;
	КонецЕсли;
КонецЕсли;

Объект.СкидкиРассчитаны = Истина;

Объект.СуммаДокумента = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(Объект.Товары, Объект.ЦенаВключаетНДС);
